app/controllers/api/channels_controller.rb

  def index
    if params[:user_id] != 'undefined'
     @channels = selected_user.subscribed_channels
    else
      @channels = Channel.all
---
SELECT "channels".* FROM "channels"

  def selected_user
    User.find_by(id: params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]