app/views/api/users/show.json.jbuilder

SELECT "channels".* FROM "channels" INNER JOIN "channel_memberships" ON "channels"."id" = "channel_memberships"."channel_id" WHERE "channel_memberships"."user_id" = $1  [["user_id", 7]]
---

@user.channel_memberships.each do |membership|