app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "yVAjkyw6h1M9BRlnhHLrbw"], ["LIMIT", 1]]
---
  def current_user
    #check for session token before searching db
    return nil unless session[:session_token]
    @current_user ||= User.find_by(session_token: session[:session_token])