app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "zeus@athens.com"], ["LIMIT", 1]]
---
  def self.find_user_by_credentials(email, password)
    user = User.find_by(email: email)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "cVmIzxJbPLrzE6yIcEjROA"], ["updated_at", "2020-04-28 21:34:51.494968"], ["id", 2]]
---
  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64
    # remove loud save after testing
    self.save!