app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test3@gmail.com"], ["LIMIT", 1]]
---
  def self.find_user_by_credentials(username, password)
    user = User.find_by(username: username)